# Задача 1: Нахождение максимума из двух чисел (X и Y)
# Числа уже заданы внутри программы

# 1. Задаём числа X и Y прямо в коде
x = 10
y = 5

# 2. Выводим исходные числа
print("Число X:", x)
print("Число Y:", y)

# 3. Проверка условия (X > Y)
if x > y:
    max_value = x
else:
    max_value = y

# 4. Вывод результата
print("Максимальное число:", max_value)